In [2]:
# Import Required Libraries 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print("Libraries Imported...")

Libraries Imported...

In [10]:
# Creating a DataSet there are many ways dictionary is best one because we can see the data stored
car_dataset = {
    'cars': ['Telsa','BMW','Hyundai','Mahindra'],
    'Model':['Model S','i3','i20','KUV100'],
    'Range':[391,335,369,350],
    'Acceleration':[3.7,3.3,4.5,4.2]
}
car_data = pd.DataFrame(car_dataset)

In [4]:
# Displaying Data 
car_data

       cars    Model  Range  Acceleration
0     Telsa  Model S    391           3.7
1       BMW       i3    335           3.3
2   Hyundai      i20    369           4.5
3  Mahindra   KUV100    350           4.2

In [5]:
type(car_data)

pandas.core.frame.DataFrame

In [6]:
car_data['cars']

0       Telsa
1         BMW
2     Hyundai
3    Mahindra
Name: cars, dtype: object

In [7]:
type(car_data['cars'])

pandas.core.series.Series

In [8]:
car_data[['cars','Model']]

       cars    Model
0     Telsa  Model S
1       BMW       i3
2   Hyundai      i20
3  Mahindra   KUV100

In [12]:
car_data ['Booster'] = np.array([.4,.6,.3,0.5])

In [13]:
car_data

       cars    Model  Range  Acceleration  Booster
0     Telsa  Model S    391           3.7      0.4
1       BMW       i3    335           3.3      0.6
2   Hyundai      i20    369           4.5      0.3
3  Mahindra   KUV100    350           4.2      0.5

In [14]:
car_data['Boosted_Acceleration'] = car_data['Acceleration'] = car_data['Booster']

In [15]:
car_data

       cars    Model  Range  Acceleration  Booster  Boosted_Acceleration
0     Telsa  Model S    391           0.4      0.4                   0.4
1       BMW       i3    335           0.6      0.6                   0.6
2   Hyundai      i20    369           0.3      0.3                   0.3
3  Mahindra   KUV100    350           0.5      0.5                   0.5

In [16]:
car_data.drop(columns = ['Boosted_Acceleration'], inplace)

In [19]:
car_data.rename(columns = {'cars':'Cars'}, inplace = True)

In [20]:
car_data

       Cars    Model  Range  Acceleration  Booster
0     Telsa  Model S    391           0.4      0.4
1       BMW       i3    335           0.6      0.6
2   Hyundai      i20    369           0.3      0.3
3  Mahindra   KUV100    350           0.5      0.5

In [21]:
car_data.columns = car_data.columns.str.lower()

In [22]:
car_data

       cars    model  range  acceleration  booster
0     Telsa  Model S    391           0.4      0.4
1       BMW       i3    335           0.6      0.6
2   Hyundai      i20    369           0.3      0.3
3  Mahindra   KUV100    350           0.5      0.5